docs/OscarHost/Add_Demographic_WSDL.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.oscarehr.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:addDemographic>
         <!--Optional:-->
         <arg0>
<!--            <activeCount>1</activeCount>-->
            <!--Optional:-->
            <address>2286 Ottawa</address>
            <!--Optional:-->
<!--            <alias>?</alias>-->
            <!--Optional:-->
<!--            <anonymous>?</anonymous>-->
            <!--Optional:-->
<!--            <chartNo>?</chartNo>-->
            <!--Optional:-->
<!--            <children>?</children>-->
            <!--Optional:-->
<!--            <citizenship>?</citizenship>-->
            <!--Optional:-->
            <city>West Vancouver</city>
            <!--Optional:-->
<!--            <dateJoined></dateJoined>-->
            <!--Optional:-->
            <dateOfBirth>06</dateOfBirth>
            <!--Optional:-->
<!--            <demographicNo>?</demographicNo>-->
            <!--Optional:-->
            <displayName>TestUserAddDemographic</displayName>
            <!--Optional:-->
<!--            <effDate></effDate>-->
            <!--Optional:-->
            <email>polydaic@gmail.com</email>
            <!--Optional:-->
<!--            <endDate></endDate>-->
            <!--Optional:-->
<!--            <familyDoctor>  </familyDoctor>-->
            <!--Optional:-->
            <firstName>TestUser</firstName>
            <!--Optional:-->
<!--            <hcRenewDate></hcRenewDate>-->
            <!--Optional:-->
<!--            <hcType></hcType>-->
            <!--Optional:-->
<!--            <headRecord></headRecord>-->
            <!--Optional:-->
<!--            <hin></hin>-->
<!--            <hsAlertCount>0</hsAlertCount>-->
            <!--Optional:-->
            <lastName>AddDemographic</lastName>
            <!--Optional:-->
            <lastUpdateDate>2015-10-01T18:39:46.817Z</lastUpdateDate>
            <!--Optional:-->
<!--            <lastUpdateUser>  </lastUpdateUser>-->
            <!--Optional:-->
<!--            <links>  </links>-->
            <!--Optional:-->
            <monthOfBirth>06</monthOfBirth>
            <!--Optional:-->
<!--            <myOscarUserName>  </myOscarUserName>-->
            <!--Optional:-->
<!--            <officialLanguage>  </officialLanguage>-->
            <!--Optional:-->
<!--            <patientStatus>  </patientStatus>-->
            <!--Optional:-->
<!--            <patientStatusDate></patientStatusDate>-->
            <!--Optional:-->
<!--            <pcnIndicator>  </pcnIndicator>-->
            <!--Optional:-->
            <phone>6048786969</phone>
            <!--Optional:-->
<!--            <phone2>  </phone2>-->
            <!--Optional:-->
            <postal>V8V5S8</postal>
            <!--Optional:-->
<!--            <previousAddress>  </previousAddress>-->
            <!--Optional:-->
<!--            <providerNo>  </providerNo>-->
            <!--Optional:-->
            <province>BC</province>
            <!--Optional:-->
<!--            <rosterDate></rosterDate>-->
            <!--Optional:-->
<!--            <rosterStatus>  </rosterStatus>-->
            <!--Optional:-->
<!--            <rosterTerminationDate></rosterTerminationDate>-->
            <!--Optional:-->
<!--            <rosterTerminationReason>  </rosterTerminationReason>-->
            <!--Optional:-->
            <sex>M</sex>
            <!--Optional:-->
<!--            <sexDesc>  </sexDesc>-->
            <!--Optional:-->
<!--            <sin>  </sin>-->
            <!--Optional:-->
<!--            <sourceOfIncome>  </sourceOfIncome>-->
            <!--Optional:-->
<!--            <spokenLanguage>  </spokenLanguage>-->
            <!--Optional:-->
            <title>Mr.</title>
            <!--Optional:-->
<!--            <ver>  </ver>-->
            <!--Optional:-->
            <yearOfBirth>1994</yearOfBirth>
         </arg0>
      </ws:addDemographic>
   </soapenv:Body>
</soapenv:Envelope>
